app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @article = Article.find(params[:id]) #Получаем значения по идентификатору

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello!"], ["text", "sadasd"], ["created_at", "2019-06-10 15:38:59.571532"], ["updated_at", "2019-06-10 15:38:59.571532"]]
---
  def create
    @article = Article.new(article_params) #сохранение параметров в БД

    if @article.valid? #Проверка валидации
      @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @article = Article.find(params[:id]) #Получаем значения по идентификатору

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "Hello mad world!"], ["updated_at", "2019-06-10 05:07:29.833973"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id]) #Получаем статью
    if @article.update(article_params)