app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Leha"], ["body", "Admin, udali!"], ["article_id", 1], ["created_at", "2019-06-11 09:59:39.706347"], ["updated_at", "2019-06-11 09:59:39.706347"]]
---
  def create

  @article = Article.find(params[:article_id]) #находим определенный пост по айди
  @article.comments.create(comment_params) #создаём коммент