app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "wadad"], ["message", "wadadsa"], ["created_at", "2019-06-08 13:32:50.979674"], ["updated_at", "2019-06-08 13:32:50.979674"]]
---
  def create
    @contact = Contact.new(contact_params) #сохранение параметров в БД

    if @contact.valid? #Проверка валидации
      @contact.save